PanosPyr/STM32_Learning/task_scheduler/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include <stdio.h>
#include "main.h"
#include "stm32f4xx.h"

#if !defined(__SOFT_FP__) && defined(__ARM_FP)
  #warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif

void idle_task(void);
void task1_handler(void);
void task2_handler(void);
void task3_handler(void);
void task4_handler(void);

void init_systick_timer(uint32_t tick_hz);
__attribute__((naked)) void init_scheduler_stack(uint32_t sched_top_of_stack);
void init_task_stack(void);
__attribute__((naked)) void switch_sp_to_psp(void);
void enable_processor_faults(void);
uint32_t get_psp_value(void);
void update_global_tick_count(void);
void unblock_tasks(void);

void task_delay(uint32_t tick_count);

uint8_t current_task = 1; //task 1 is running
uint32_t g_tick_count = 0;

typedef struct
{
	uint32_t psp_value;
	uint32_t block_count;
	uint8_t current_state;
	void (*task_handler)(void);
}TCB_t;

TCB_t user_tasks[MAX_TASKS];

int main(void)
{
	RCC->AHB1ENR |= GPIOAEN;

	GPIOA->MODER |= (1U<<10);
	GPIOA->MODER &= ~(1U<<11);

	enable_processor_faults();

	init_scheduler_stack(SCHED_STACK_START);

	init_task_stack();
	init_systick_timer(TICK_HZ);

	switch_sp_to_psp();

	task1_handler();

    /* Loop forever */
	for(;;);
}

void idle_task(void)
{
	while(1)
	{

	}
}

void task1_handler(void)
{
	while(1){
		GPIOA->ODR |= LED_PIN;
		task_delay(1000);
		GPIOA->ODR &= ~LED_PIN;
		task_delay(1000);
	}
}

void task2_handler(void)
{
	while(1){
		printf("LED 2 ON\n");
		task_delay(500);
		printf("LED 2 OFF\n");
		task_delay(500);
	}
}

void task3_handler(void)
{
	while(1){
		printf("LED 3 ON\n");
		task_delay(250);
		printf("LED 3 OFF\n");
		task_delay(250);
	}
}

void task4_handler(void)
{
	while(1){
		printf("LED 4 ON\n");
		task_delay(125);
		printf("LED 4 OFF\n");
		task_delay(125);
	}
}

void init_systick_timer(uint32_t tick_hz)
{
	uint32_t *pSRVR = (uint32_t*)0xE000E014;
	uint32_t *pSCSR = (uint32_t*)0xE000E010;

	uint32_t count_value = (SYSTICK_TIM_CLK / tick_hz) - 1;

	//Clear SVR value
	*pSRVR &= ~(0x00FFFFFFFF);

	//Load the value into SVR
	*pSRVR |= count_value;

	//Do some settings
	*pSCSR |= (1 << 1); //Enable SysTick exception request
	*pSCSR |= (1 << 2); //Set processor clock as the clock source

	//Enable the SysTick
	*pSCSR |= (1 << 0); //Enable the counter
}

__attribute__((naked)) void init_scheduler_stack(uint32_t sched_top_of_stack)
{
	__asm volatile("MSR MSP,R0");
	//__asm volatile("MSR MSP,%0":: "r"(sched_top_of_stack):); //Same functionality as one above
	__asm volatile("BX LR");
}

void init_task_stack(void)
{
	user_tasks[0].current_state = TASK_READY_STATE;
	user_tasks[1].current_state = TASK_READY_STATE;
	user_tasks[2].current_state = TASK_READY_STATE;
	user_tasks[3].current_state = TASK_READY_STATE;
	user_tasks[4].current_state = TASK_READY_STATE;

	user_tasks[0].psp_value = IDLE_STACK_START;
	user_tasks[1].psp_value = T1_STACK_START;
	user_tasks[2].psp_value = T2_STACK_START;
	user_tasks[3].psp_value = T3_STACK_START;
	user_tasks[4].psp_value = T4_STACK_START;

	user_tasks[0].task_handler = idle_task;
	user_tasks[1].task_handler = task1_handler;
	user_tasks[2].task_handler = task2_handler;
	user_tasks[3].task_handler = task3_handler;
	user_tasks[4].task_handler = task4_handler;

	uint32_t *pPSP;
	for(int i = 0; i < MAX_TASKS; i++)
	{
		pPSP = (uint32_t*) user_tasks[i].psp_value;

		pPSP--; //XPSR
		*pPSP = DUMMY_XPSR;

		pPSP--; //PC
		*pPSP = (uint32_t) user_tasks[i].task_handler;

		pPSP--; //LR
		*pPSP = 0xFFFFFFFD;

		for(int j = 0; j < 13; j++)
		{
			pPSP--; //R0->R12
			*pPSP = 0x00;
		}

		user_tasks[i].psp_value = (uint32_t)pPSP;
	}
}

uint32_t get_psp_value(void)
{
	return user_tasks[current_task].psp_value;
}

void save_psp_value(uint32_t current_psp_value)
{
	user_tasks[current_task].psp_value = current_psp_value;
}

void update_next_task(void)
{
	int state = TASK_BLOCKED_STATE;

	for(int i = 0; i < MAX_TASKS; i++)
	{
		current_task++;
		current_task %= MAX_TASKS;
		state = user_tasks[current_task].current_state;
		if((state == TASK_READY_STATE) && (current_task != 0))
			break;
	}

	if(state != TASK_READY_STATE)
		current_task = 0;
}

__attribute__((naked)) void switch_sp_to_psp(void)
{
	//1. Init PSP with task1 stack start addr

	//Get PSP value of current stack
	__asm volatile ("PUSH {LR}"); //preserve LR which connects back to main()
	__asm volatile ("BL get_psp_value");
	__asm volatile ("MSR PSP,R0"); //init psp
	__asm volatile ("POP {LR}"); //pops back LR value

	//2. Change SP to PSP using CONTROL register
	__asm volatile ("MOV R0,#0x02");
	__asm volatile ("MSR CONTROL,R0");
	__asm volatile ("BX LR");
}

void enable_processor_faults(void)
{
	uint32_t *pSHCSR = (uint32_t*)0xE000ED24;

	*pSHCSR |= ( 1 << 16); //mem manage
	*pSHCSR |= ( 1 << 17); //bus fault
	*pSHCSR |= ( 1 << 18); //usage fault
}

void schedule(void)
{
	uint32_t *pICSR = (uint32_t*)0xE000ED04;

	//Pend the PendSV exception
	*pICSR |= (1 << 28);
}


void task_delay(uint32_t tick_count)
{
	//disable interrupt
	INTERRUPT_DISABLE();

	if(current_task){
		user_tasks[current_task].block_count = g_tick_count + tick_count;
		user_tasks[current_task].current_state = TASK_BLOCKED_STATE;
		schedule();
	}

	//enable interrupt
	INTERRUPT_ENABLE();
}


__attribute__((naked)) void PendSV_Handler(void)
{
	/*Save the context of current task*/

	//1. Get current running task's PSP value
	__asm volatile ("MRS R0,PSP");
	//2. Using that PSP value, store SF2(R4 to R11)
	__asm volatile ("STMDB R0!, {R4-R11}");
	//Preserve LR which connects back to main()
	__asm volatile ("PUSH {LR}");
	//3. Save the current value of PSP
	__asm volatile ("BL save_psp_value");

	/*Retrieve the context of next task*/

	//1. Decide next task to run
	__asm volatile ("BL update_next_task");
	//2. Get its past PSP value
	__asm volatile ("BL get_psp_value");
	//3. Using that PSP value retrieve SF2
	__asm volatile ("LDMIA R0!,{R4-R11}");
	//4. Update PSP and exit
	__asm volatile ("MSR PSP,R0");
	//Preserve LR which connects back to main()
	__asm volatile ("POP {LR}");
	//Return
	__asm volatile ("BX LR");
}

void update_global_tick_count(void)
{
	g_tick_count++;
}

void unblock_tasks(void)
{
	for(int i = 1; i < MAX_TASKS; i++)
	{
		if(user_tasks[i].current_state != TASK_READY_STATE)
		{
			if(user_tasks[i].block_count == g_tick_count)
			{
				user_tasks[i].current_state = TASK_READY_STATE;
			}
		}
	}
}

void SysTick_Handler(void)
{
	uint32_t *pICSR = (uint32_t*)0xE000ED04;

	update_global_tick_count();
	unblock_tasks();
	//Pend the PendSV exception
	*pICSR |= (1 << 28);
}

void HardFault_Handler(void)
{
	printf("Exception : Hardfault\n");
	while(1);
}


void MemManage_Handler(void)
{
	printf("Exception : MemManage\n");
	while(1);
}

void BusFault_Handler(void)
{
	printf("Exception : BusFault\n");
	while(1);
}

__attribute__ ((naked)) void UsageFault_Handler(void){
	//here we extracted the value of MSP which happens to be the
	//base address of the stack frame(thread mode) which got saved during the exception entry
	//from thread mode to handler mode
	__asm ("MRS r0,MSP");
	__asm ("B UsageFault_Handler_c");
}

void UsageFault_Handler_c(uint32_t *pBaseStackFrame)
{

	uint32_t *pUFSR = (uint32_t*)0xE000ED2A;
	printf("Exception : UsageFault\n");
	printf("UFSR = %lx\n",(*pUFSR) & 0xFFFF);
	printf("pBaseStackFrame = %p\n",pBaseStackFrame);
	printf("Value of R0 = %lx\n",pBaseStackFrame[0]);
	printf("Value of R1 = %lx\n",pBaseStackFrame[1]);
	printf("Value of R2 = %lx\n",pBaseStackFrame[2]);
	printf("Value of R3 = %lx\n",pBaseStackFrame[3]);
	printf("Value of R12 = %lx\n",pBaseStackFrame[4]);
	printf("Value of LR = %lx\n",pBaseStackFrame[5]);
	printf("Value of PC = %lx\n",pBaseStackFrame[6]);
	printf("Value of XPSR = %lx\n",pBaseStackFrame[7]);
	while(1);
}
